<?php
/*$fruits[55] = "бананы";
$fruits[23] = "апельсины";
$fruits["яблоки"] = array("Гренны"=>5,"Глостер"=>8);

echo $fruits["яблоки"]["Глостер"];*/

$auto["Audi TT"]=array("скорость"=>200,"цвет"=>"серый","год выпуска"=>2005);
$auto["BMW M4"]=array("скорость"=>210,"цвет"=>"синий","год выпуска"=>2013);
$auto["ВАЗ 2101"]=array("скорость"=>150,"цвет"=>"белый","год выпуска"=>1970);
$auto["ВАЗ 2102"]=array("скорость"=>140,"цвет"=>"горничный","год выпуска"=>1973);


foreach ($auto as $k=>$v)
{
    echo "<a href='?model=$k'>$k</a><br>";
}




    echo "По запросу \"{$_GET['model']}\" найдено:<br>";
    foreach ($auto[$_GET['model']] as $k1=>$v1)
    {
        echo $k1." - ";
        echo $v1."<br>";
    }

/*    define("NAME","Даниил");
    echo NAME;*/

